brew "coreutils"
brew "fd"
brew "fnm"
brew "fzf"
brew "xz"
brew "gemini-cli"
brew "gh"
brew "go"
brew "htop"
brew "jq"
brew "mas"
brew "neovim"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
cask "antigravity"
cask "aqua-voice"
cask "claude"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "obsidian"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "kilocode.kilo-code"
